const PHYSICS_1ST = {
  "ভৌতজগত ও পরিমাপ": [],
  "ভেক্টর": [],
  "নিউটনিয়ান বলবিদ্যা": [],
  "কাজ, ক্ষমতা, ও শক্তি": [],
  "মহাকর্ষ ও অভিকর্ষ": [],
  "পদার্থের গাঠনিক ধর্ম": [],
  "পর্যায়বৃত্ত গতি": [],
  "আদর্শ গ্যাস ও গ্যাসের গতিতত্ত্ব": [],
} as const;

const PHYSICS_2ND = {
  "তাপগতিবিদ্যা": [],
  "স্থির তড়িৎ": [],
  "চল তড়িৎ": [],
  "ভৌত আলোকবিজ্ঞান": [],
  "আধুনিক পদার্থ বিজ্ঞান": [],
  "পরমাণুর মডেল ও নিউক্লিয়ার পদার্থবিজ্ঞান": [],
  "সেমিকন্ডাক্টর ও ইলেক্ট্রনিক্স": [],
} as const;

const CHEMISTRY_1ST = {
  "গুণগত রসায়ন": [],
  "মৌলের পর্যায়বৃত্ত ধর্ম ও রাসায়নিক বন্ধন": [],
  "রাসায়নিক পরিবর্তন": [],
  "কর্মমুখী রসায়ন": [],
} as const;

const CHEMISTRY_2ND = {
  "পরিবেশ রসায়ন": [],
  "জৈব যৌগ": [],
  "পরিমাণগত রসায়ন": [],
  "তড়িৎ রসায়ন": [],
} as const;

const MATHEMATICS_1ST = {
  "ম্যাট্রিক্স ও নির্ণায়ক": [],
  "সরলরেখা": [],
  "বৃত্ত": [],
  "সংযুক্ত ও যৌগিক কোণের ত্রিকোণমিতিক অনুপাত": [],
  "ফাংশন ও ফাংশনের লেখচিত্র": [],
  "অন্তরীকরণ": [],
  "যোগজীকরণ": [],
} as const;

const MATHEMATICS_2ND = {
  "জটিল সংখ্যা": [],
  "বহুপদী ও বহুপদী সমীকরণ": [],
  "কণিক": [],
  "বিপরীত ত্রিকোণমিতিক ফাংশন ও ত্রিকোণমিতিক সমীকরণ": [],
  "স্থিতিবিদ্যা": [],
  "সমতলে বস্তুকণার গতি": [],
} as const;

const BIOLOGY_1ST = {
  "কোষ ও এর গঠন": [],
  "কোষ বিভাজন": [],
  "অণুজীব": [],
  "নগ্নবীজী ও আবৃতবীজী উদ্ভিদ": [],
  "টিসু ও টিসুতন্ত্র": [],
  "উদ্ভিদ শরীরতত্ত্ব": [],
  "জীব প্রযুক্তি": [],
} as const;

const BIOLOGY_2ND = {
  "প্রাণীর ভিন্নতা ও শ্রেণিবিন্যাস": [],
  "প্রাণীর পরিচিতি": [],
  "পরিপাক ও শোষণ": [],
  "রক্ত সঞ্চালন": [],
  "শ্বাসক্রিয়া শ্বসন": [],
  "চলন ও অঙ্গচালনা": [],
  "জিনতত্ত্ব ও বিবর্তন": [],
} as const;

const INFORMATION_TECHNOLOGY = {
  "বিশ্ব ও বাংলাদেশ পরিচিতি": [],
  "কমিউনিকেশন সিস্টেমস ও নেটওয়ার্কিং": [],
  "সংখ্যা পদ্ধতি ও ডিজিটাল ডিভাইস": [],
  "ওয়েব ডিজাইন পরিচিতি এবং এইচটিএমএল": [],
  "প্রোগ্রামিং ভাষা": [],
} as const;

const BANGLA_1ST = {
  "অপরিচিতা": [],
  "বিলাসী": [],
  "আমার পথ": [],
  "মানব কল্যাণ": [],
  "মাসি-পিসি": [],
  "বায়ান্নর দিনগুলো ": [],
  "রেইনকোট": [],
  "সোনার তরী": [],
  "বিদ্রোহী": [],
  "প্রতিদান": [],
  "তাহারেই পড়ে মনে": [],
  "আঠারো বছর বয়স": [],
  "ফেব্রুয়ারি ১৯৬৯": [],
  "আমি কিংবদন্তির কথা বলছি": [],
  "লালসালু": [],
  "সিরাজউদ্দৌলা": [],
} as const;

const BANGLA_2ND = {
  "ধ্বনিতত্ত্ব": [],
  "অর্থতত্ত্ব": [],
  "অনুবাদ": [],
  "ক্রিয়ার কাল": [],
} as const;

// const ENGLISH = {} as const;

export const SYLLABUS = {
  "পদার্থবিজ্ঞান ১ম": PHYSICS_1ST,
  "পদার্থবিজ্ঞান ২য়": PHYSICS_2ND,
  "রসায়ন ১ম": CHEMISTRY_1ST,
  "রসায়ন ২য়": CHEMISTRY_2ND,
  "উচ্চতর গণিত ১ম": MATHEMATICS_1ST,
  "উচ্চতর গণিত ২য়": MATHEMATICS_2ND,
  "জীববিজ্ঞান ১ম": BIOLOGY_1ST,
  "জীববিজ্ঞান ২য়": BIOLOGY_2ND,
  "তথ্য ও যোগাযোগ প্রযুক্তি": INFORMATION_TECHNOLOGY,
  "বাংলা ১ম": BANGLA_1ST,
  "বাংলা ২য়": BANGLA_2ND,
  // "English": ENGLISH,
} as const;
